9hm2/esp32-2432s022/apps/serial-terminal/src/main.cpp
// Serial Terminal (VT100) — Raspberry Pi soros konzol az ESP32-2432S022C-n
// ========================================================================
// Valódi VT100/ANSI terminál: karakterrács + kurzor + escape-szekvenciák
// (kurzormozgás, törlés, görgetés, SGR színek/attribútumok). A rácsot egyedi
// LVGL rajzolással jelenítjük meg, kis monospace fonttal.
//
// BEKÖTÉS a Raspberry Pi-hez (a panel P1 / "4P 1.25 Power supply base" portja,
// UART0): Pi TXD -> RXD(GPIO3), Pi RXD <- TXD(GPIO1), GND <-> GND. 3.3V logika.
// Az app NEM ír debug üzenetet az UART0-ra, hogy ne zavarja a kapcsolatot.

#include <Arduino.h>
#include <esp32_smartdisplay.h>
#include <esp_lcd_panel_ops.h>

#include "config.h"
#include "launcher_return.h"
#include "vt100.h"
#include "wifi_bridge.h"

static TermConfig cfg;
static Vt100 vt;

// Kis monospace font (DejaVu Sans Mono, 8px, bpp1, advance 5px-re fixálva).
// Cella: 5 px széles x 10 px magas (= a font line_height-ja -> nincs sor-átfedés).
// A renderelés FUTAM-ALAPÚ: egy soron belül az azonos szín/attribútumú cellákat
// EGY lv_draw_label-lel rajzoljuk (nem cellánként) -> sokkal kevesebb rajzfeladat.
extern const lv_font_t term_font;
static constexpr int CELL_W = 5;
static constexpr int CELL_H = 10;
static constexpr int TOP_H = 22; // felso sáv (állapot + gombok)

// --- UI elemek -------------------------------------------------------------
static lv_obj_t *term_obj = nullptr;   // egyedi rajzolású terminál
static lv_obj_t *status_lbl = nullptr;
static lv_obj_t *kb_overlay = nullptr;
static lv_obj_t *input_ta = nullptr;
static lv_obj_t *set_overlay = nullptr;
static lv_obj_t *dd_baud = nullptr;
static lv_obj_t *dd_le = nullptr;
static lv_obj_t *sw_echo = nullptr;
static lv_obj_t *dd_rot = nullptr;
static lv_obj_t *sw_wifi = nullptr;

static bool g_rebuild = false;

static int32_t scrW() { return lv_display_get_horizontal_resolution(NULL); }
static int32_t scrH() { return lv_display_get_vertical_resolution(NULL); }
static int32_t imin(int32_t a, int32_t b) { return a < b ? a : b; }

static void build_ui();
static void show_keys();

// A felso sáv váltogatott oldala: 0 = port-beállítások, 1 = Wi-Fi/IP.
static int s_statusPage = 0;

static void update_status()
{
    static const char *le_short[] = {"-", "LF", "CRLF", "CR"};

    if (vt.scroll() > 0)
    {
        lv_label_set_text_fmt(status_lbl, LV_SYMBOL_UP " SCROLL -%d/%d  (drag)",
                              vt.scroll(), vt.scrollbackCount());
        return;
    }

    // Wi-Fi bekapcsolva: váltogatjuk a port-beállításokat és az IP-t.
    if (wifi_bridge_running() && s_statusPage == 1)
    {
        if (wifi_bridge_connected())
            lv_label_set_text_fmt(status_lbl, LV_SYMBOL_WIFI " %s : telnet 23",
                                  wifi_bridge_ip().c_str());
        else
            lv_label_set_text(status_lbl, LV_SYMBOL_WIFI " connecting...");
        return;
    }

    lv_label_set_text_fmt(status_lbl, LV_SYMBOL_USB " RPi %lu 8N1 %s%s",
                          (unsigned long)cfg.baud,
                          le_short[cfg.lineEnding <= 3 ? cfg.lineEnding : 0],
                          cfg.localEcho ? " echo" : "");
}

// --- Terminál rajzolása (egyedi LVGL draw) ---------------------------------

static void term_draw_cb(lv_event_t *e)
{
    lv_obj_t *obj = lv_event_get_target_obj(e);
    lv_layer_t *layer = lv_event_get_layer(e);
    lv_area_t area;
    lv_obj_get_content_coords(obj, &area);
    const int32_t ox = area.x1, oy = area.y1;

    // Csak a vágási területbe eso sorokra/oszlopokra dolgozunk.
    const lv_area_t clip = layer->_clip_area;
    int y0 = (clip.y1 - oy) / CELL_H, y1 = (clip.y2 - oy) / CELL_H;
    int x0 = (clip.x1 - ox) / CELL_W, x1 = (clip.x2 - ox) / CELL_W;
    if (y0 < 0) y0 = 0;
    if (x0 < 0) x0 = 0;
    if (y1 >= vt.rows()) y1 = vt.rows() - 1;
    if (x1 >= vt.cols()) x1 = vt.cols() - 1;

    lv_draw_rect_dsc_t rd;
    lv_draw_rect_dsc_init(&rd);
    rd.bg_opa = LV_OPA_COVER;

    lv_draw_label_dsc_t ld;
    lv_draw_label_dsc_init(&ld);
    ld.font = &term_font;
    ld.opa = LV_OPA_COVER;
    ld.letter_space = 0;

    const bool live = (vt.scroll() == 0);
    char run[VT_MAX_COLS + 1];

    for (int y = y0; y <= y1; y++)
    {
        const int32_t cy = oy + y * CELL_H;
        int x = x0;
        while (x <= x1)
        {
            // A cella effektív szín-állapota (inverz/kurzor figyelembevételével).
            auto cellColors = [&](int cx, lv_color_t &fg, lv_color_t &bg) {
                const VtCell &c = vt.viewCell(cx, y);
                // Félkövér: a 0-7 alap-szín helyett a világos (8-15) változat.
                uint8_t fgi = c.fg;
                if ((c.flags & VT_BOLD) && !(c.flags & VT_FG_DEF) && fgi < 8)
                    fgi += 8;
                fg = (c.flags & VT_FG_DEF) ? Vt100::defaultFg() : Vt100::palette(fgi);
                bg = (c.flags & VT_BG_DEF) ? Vt100::defaultBg() : Vt100::palette(c.bg);
                bool inv = (c.flags & VT_INVERSE) != 0;
                if (live && vt.cursorVisible() && cx == vt.curX() && y == vt.curY())
                    inv = !inv;
                if (inv) { lv_color_t t = fg; fg = bg; bg = t; }
            };

            lv_color_t fg, bg;
            cellColors(x, fg, bg);

            // Futam: azonos fg+bg egymás után (a clip-en belül).
            int xe = x;
            while (xe + 1 <= x1)
            {
                lv_color_t f2, b2;
                cellColors(xe + 1, f2, b2);
                if (!lv_color_eq(f2, fg) || !lv_color_eq(b2, bg))
                    break;
                xe++;
            }

            const int32_t runX = ox + x * CELL_W;
            const int runLen = xe - x + 1;

            // Háttér a futamra (csak ha nem az alap fekete).
            if (!lv_color_eq(bg, Vt100::defaultBg()))
            {
                rd.bg_color = bg;
                lv_area_t ca = {runX, cy, runX + runLen * CELL_W - 1, cy + CELL_H - 1};
                lv_draw_rect(layer, &rd, &ca);
            }

            // A futam szövege egy label-lel; üres (csupa szóköz) futamot kihagyunk.
            bool hasInk = false;
            for (int i = 0; i < runLen; i++)
            {
                uint8_t ch = vt.viewCell(x + i, y).ch;
                run[i] = (ch >= 0x20 && ch < 0x7F) ? (char)ch : ' ';
                if (run[i] != ' ') hasInk = true;
            }
            run[runLen] = '\0';

            if (hasInk)
            {
                ld.color = fg;
                ld.text = run;
                ld.text_length = runLen;
                ld.text_local = 1; // az LVGL lemásolja a szöveget
                lv_area_t la = {runX, cy, runX + runLen * CELL_W, cy + CELL_H - 1};
                lv_draw_label(layer, &ld, &la);
            }

            x = xe + 1;
        }
    }
}

// --- UART <-> terminál -----------------------------------------------------

static void pump_serial()
{
    uint8_t batch[64];
    int n = 0;
    int budget = 1024;
    while (Serial.available() > 0 && budget-- > 0)
    {
        int b = Serial.read();
        if (b < 0)
            break;
        vt.feed((uint8_t)b);
        batch[n++] = (uint8_t)b;
        if (n == (int)sizeof(batch)) { wifi_bridge_write(batch, n); n = 0; }
    }
    if (n)
        wifi_bridge_write(batch, n); // a Pi kimenetét a telnet kliensnek is
}

static void send_line(const char *t)
{
    if (!t)
        return;
    Serial.print(t);
    Serial.print(line_ending_suffix(cfg.lineEnding));
    if (cfg.localEcho)
    {
        vt.feedStr(t);
        vt.feed('\r');
        vt.feed('\n');
    }
    vt.scrollToBottom(); // válasz látható legyen
}

// Nyers byte-sorozat küldése (speciális billentyukhöz: nyilak, Ctrl-C, Esc...).
static void send_raw(const char *seq)
{
    if (!seq)
        return;
    Serial.write((const uint8_t *)seq, strlen(seq));
    vt.scrollToBottom();
}

